{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "filters": 64, "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "activation": "elu", "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "padding": "same", "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "elu", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_7", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "elu", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_8", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "elu", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_9", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "rate": 0.5, "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "filters": 128, "bias_constraint": null, "dilation_rate": [1, 1], "activation": "elu", "kernel_size": [5, 5], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "name": "conv2d_10", "activity_regularizer": null, "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "rate": 0.5, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_4", "units": 1024, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_9", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_5", "units": 1024, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_10", "rate": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "name": "dense_6", "units": 10, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "keras_version": "2.0.3", "backend": "tensorflow"}