{"class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dtype": "float32", "trainable": true, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_6", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_7", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_8", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_9", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_10", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 10, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_regularizer": null}}], "backend": "tensorflow"}