{"class_name": "Sequential", "keras_version": "2.0.3", "config": [{"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "batch_input_shape": [null, 28, 28, 1], "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "dtype": "float32", "trainable": true, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 7], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 7], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_11", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 7], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 7], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_12", "trainable": true}}, {"class_name": "Conv2D", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "filters": 128, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2d_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "data_format": "channels_last", "kernel_size": [7, 7], "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_13", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_14", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "elu", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 1024, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_15", "trainable": true}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "units": 10, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_regularizer": null}}], "backend": "tensorflow"}